app/controllers/fortunes_controller.rb

def index
  @fortunes = Fortune.search(params[:search]).order(:source).page(params[:page]).per(4)
---
SELECT "fortunes".* FROM "fortunes" WHERE (quotation LIKE '%everything%') ORDER BY source LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "fortunes" WHERE (quotation LIKE '%everything%')

def show
  @fortune = Fortune.find(params[:id])
---
SELECT "fortunes".* FROM "fortunes" WHERE "fortunes"."id" = ? LIMIT 1  [["id", "5"]]

  def edit
    @fortune = Fortune.find(params[:id])
---
SELECT "fortunes".* FROM "fortunes" WHERE "fortunes"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @fortune = Fortune.new(params[:fortune])
    @fortune.save
---
INSERT INTO "fortunes" ("created_at", "quotation", "source", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 13 Nov 2011 22:17:38 UTC +00:00], ["quotation", "Nigdy nie jest za pozno, aby odrabiac zaleglosci."], ["source", ""], ["updated_at", Sun, 13 Nov 2011 22:17:38 UTC +00:00]]

  def update
    @fortune = Fortune.find(params[:id])
    @fortune.update_attributes(params[:fortune])
---
SELECT "fortunes".* FROM "fortunes" WHERE "fortunes"."id" = ? LIMIT 1  [["id", "10"]]
UPDATE "fortunes" SET "updated_at" = '2011-11-13 23:21:59.819050', "quotation" = 'testowa' WHERE "fortunes"."id" = 10

  def destroy
    @fortune = Fortune.find(params[:id])
    @fortune.destroy
---
SELECT "fortunes".* FROM "fortunes" WHERE "fortunes"."id" = ? LIMIT 1  [["id", "11"]]
DELETE FROM "fortunes" WHERE "fortunes"."id" = ?  [["id", 11]]