app/controllers/sessions_controller.rb

INSERT INTO "users" ("created_at", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 21 Nov 2011 09:16:02 UTC +00:00], ["name", "Adam Kowalski"], ["provider", "twitter"], ["uid", "417413321"], ["updated_at", Mon, 21 Nov 2011 09:16:02 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."provider" = 'twitter' AND "users"."uid" = '417413321' LIMIT 1
---
def create
  auth = request.env["omniauth.auth"]
  user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)